# IsShown Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane..::..IsShown Method
DockablePane Class See Also
---
Identify the pane is currently visible or in a tab.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsShown()
```

Visual Basic
---
```text
Public Function IsShown As Boolean
```

Visual C++
---
```text
public:
bool IsShown()
```

# See Also
DockablePane Class
Autodesk.Revit.UI Namespace